manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
#include "stubs/Arduino.h"
#include "stubs/nrf52840.h"
#include "stubs/OneButton.h"
#include "stubs/bluefruit.h"
#include "stubs/Adafruit_LittleFS.h"
#include <cassert>
#include <iostream>
#include <algorithm>
#include <vector>

// --- stub globálisok ---
unsigned long g_millis = 1000;
uint32_t g_ADigitalPinMap[32];
SerialClass Serial;
static PowerRegs g_power;
PowerRegs* NRF_POWER = &g_power;
KeyLog g_lastKey; int g_keyCount = 0, g_consumerCount = 0;
int g_keyReleaseCount = 0, g_consumerReleaseCount = 0;
bool g_fsWriteFail = false; bool g_fsRenameFail = false; bool g_fsRemoveFail = false;
std::vector<uint16_t> g_disconnected;
uint8_t g_lastModifier = 0; uint8_t g_lastPressedCode = 0;
int g_lastConnHdl = -1; int g_sentTo[8] = {0}; int g_releasedTo[8]={0};
FakeConn g_conns[4] = {};
BluefruitStub Bluefruit;
cbfn g_pendingCb = nullptr;
InternalFSClass InternalFS;
std::map<std::string, std::string> g_fs;
#include "stubs/fs_impl.h"


#include "../../zwift_config.h"
// --- amit az Arduino IDE automatikusan generál a .ino elejére ---
void setup(); void loop();
bool writeFileAtomic(const char*, const char*, const void*, size_t);
void saveUzemmod(const char* content);
void connect_callback(uint16_t);
uzemmod readStoredMode();
void pruneLostTargets();
void updateRepeatTap(); void updateBurst();
void cbClick(void*); void cbDoubleClick(void*);
void cbLongStart(void*); void cbLongDuring(void*); void cbLongStop(void*);
void attachButtonCallbacks(); void updateLeds();
void releasePressedKeys(bool, bool);
void disconnect_callback(uint16_t, uint8_t);
void startAdv(void);
void updateButtons();
void handleSerial();
bool loadKeymap();
bool saveKeymap();
void loadDefaultKeymap();

#include "../../zwift_buttons_Seeed_XIAO_nRF52840.ino"

// A teszt a gomb-esemenyeket nevvel hivja; a firmware mar parameteres
// callbackeket hasznal, ezert itt kotjuk ossze a kettot.
static void click1(){cbClick((void*)0);} static void doubleclick1(){cbDoubleClick((void*)0);}
static void longPressStart1(){cbLongStart((void*)0);} static void longPress1(){cbLongDuring((void*)0);}
static void longPressStop1(){cbLongStop((void*)0);}
static void click2(){cbClick((void*)1);} static void doubleclick2(){cbDoubleClick((void*)1);}
static void longPressStart2(){cbLongStart((void*)1);} static void longPress2(){cbLongDuring((void*)1);}
static void longPressStop2(){cbLongStop((void*)1);}
static void click3(){cbClick((void*)2);} static void doubleclick3(){cbDoubleClick((void*)2);}
static void longPressStart3(){cbLongStart((void*)2);} static void longPress3(){cbLongDuring((void*)2);}
static void longPressStop3(){cbLongStop((void*)2);}
static void click4(){cbClick((void*)3);} static void doubleclick4(){cbDoubleClick((void*)3);}
static void longPressStart4(){cbLongStart((void*)3);} static void longPress4(){cbLongDuring((void*)3);}
static void longPressStop4(){cbLongStop((void*)3);}
static void click5(){cbClick((void*)4);} static void doubleclick5(){cbDoubleClick((void*)4);}
static void longPressStart5(){cbLongStart((void*)4);} static void longPress5(){cbLongDuring((void*)4);}
static void longPressStop5(){cbLongStop((void*)4);}


// Teszt-seged: egy BLE kapcsolat felepitese adott handle-lel es cimmel.
// A SoftDevice a kapcsolat letrejottekor abbahagyja a hirdetest.
static void connectPeer(uint16_t h, uint8_t addrPrefix, bool bonded = true) {
  g_conns[h].up = true;
  g_conns[h].bonded = bonded;
  g_conns[h].addr.addr_type = 1;
  for (int i = 0; i < 6; i++) g_conns[h].addr.addr[i] = (uint8_t)(addrPrefix + i);
  Bluefruit.Advertising.stop();
  connect_callback(h);
}
// A bontast a konyvtar sajat kezeloje is latja: az CSAK akkor indit ujra
// hirdetest, ha mar egyetlen kapcsolat sem maradt.
static void disconnectPeer(uint16_t h) {
  g_conns[h].up = false;
  disconnect_callback(h, 0x13);
  if (Bluefruit.connected() == 0 && Bluefruit.Advertising.restartOnDisc
      && !Bluefruit.Advertising.isRunning()) {
    Bluefruit.Advertising.start(0);
  }
}
// A leutes-impulzus lezarasa. Elesben ezt a fociklus (updateRepeatTap) vegzi
// repeatTapMs mulva; a tesztben kezzel leptetjuk az idot.
static void settleTap() { g_millis += repeatTapMs + 1; updateRepeatTap(); }

static int8_t slotOfConnTest(uint16_t h) { return slotOfConn(h); }

static void resetKeyState() {
  hasKeyPressed = false; hasConsumerKeyPressed = false;
  duringLongpress = false; keyPressMillis = 0; pressedTargetCount = 0;
  g_keyCount = g_consumerCount = g_keyReleaseCount = g_consumerReleaseCount = 0;
  for (int i = 0; i < 8; i++) g_sentTo[i] = 0;
}

static std::string send(const std::string& cmd) {
  Serial.tx.clear();
  Serial.feed(cmd + "\n");
  handleSerial();
  return Serial.tx;
}
static void expect(const std::string& got, const std::string& want, const char* what) {
  if (got.find(want) == std::string::npos) {
    std::cout << "HIBA (" << what << "): vart='" << want << "' kapott='" << got << "'\n";
    exit(1);
  }
}

int main() {
  std::cout << "sizeof(KeyAction)=" << sizeof(KeyAction)
            << "  sizeof(KeymapConfig)=" << sizeof(KeymapConfig) << "\n";
  assert(sizeof(KeyAction) == 10);      // + holdMs (4-es formatum)
  assert(sizeof(KeyActionV3) == 8);     // a regi bejegyzes valtozatlan
  assert(sizeof(PeerSlot) == 8);
  // fejlec 12 + terkep 450 + modeTarget 3 + reserved 1 + peers 16 + crc 4
  assert(sizeof(KeymapConfig) == 12 + 45 * 10 + 3 + 1 + 2 * 8 + 4);
  assert(sizeof(KeymapConfigV3) == 12 + 45 * 8 + 3 + 1 + 2 * 8 + 4);

  setup();
  std::cout << "-- setup lefutott, gyari kiosztas betoltve\n";

  // A tobbi teszt egy elo kapcsolatot felteteléz (mint a valosagban, amikor
  // egy host csatlakozik). A 0-s handle-t hozzuk fel.
  connectPeer(0, 0xA0);
  std::cout << "-- 1 BLE kapcsolat felepult (conn_hdl=0)\n";

  // 1) PING
  expect(send("PING"), "OK ZWIFT_BUTTONS PROTO=6 MODES=3 BUTTONS=5 EVENTS=3 SLOTS=2 CONNS=2", "PING");
  send("DBG 0");

  // 2) GET: 45 MAP sor + END
  std::string get = send("GET");
  size_t maps = 0, pos = 0;
  while ((pos = get.find("MAP ", pos)) != std::string::npos) { maps++; pos += 4; }
  assert(maps == 45);
  expect(get, "END", "GET/END");
  expect(get, "MAP 0 0 0 1 0 80 0 0", "gyari: normal/G1/rovid = balra nyil (0x50=80)");
  expect(get, "MAP 2 3 2 2 0 234 3 70 0", "gyari: media/G4/hosszu = hangero- ismetlo, kulon leutesek");
  expect(get, "MAP 0 3 1 3 0 0 0 0", "gyari: normal/G4/dupla = uzemmod valtas");
  std::cout << "-- GET ok (" << maps << " sor)\n";

  // 3) SET + visszaolvasas
  expect(send("SET 0 0 0 1 12 21 0 60"), "OK", "SET");
  expect(send("GET"), "MAP 0 0 0 1 12 21 0 60 0", "SET utani GET");
  expect(send("SET 9 0 0 1 0 4 0 60"), "ERR RANGE", "ervenytelen uzemmod");
  expect(send("SET 0 0 0 9 0 4 0 60"), "ERR VALUE", "ervenytelen tipus");
  expect(send("SET 0 0"), "ERR ARGS", "hianyzo argumentum");
  expect(send("HULYESEG"), "ERR UNKNOWN", "ismeretlen parancs");
  std::cout << "-- SET / hibakezeles ok\n";

  // 4) SAVE -> flash, majd ujraindulas szimulacio
  expect(send("SAVE"), "OK SAVED", "SAVE");
  assert(g_fs.count("/keymap.bin") == 1 && g_fs["/keymap.bin"].size() == sizeof(KeymapConfig));
  memset(&keymap, 0, sizeof(keymap));
  assert(loadKeymap());
  assert(keymap.map[0][0][0].modifier == 12 && keymap.map[0][0][0].code == 21);
  std::cout << "-- SAVE/LOAD korbeer, CRC ok\n";

