manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // 5) serult fajl -> elutasitas
  g_fs["/keymap.bin"][20] ^= 0xFF;
  assert(!loadKeymap());
  std::cout << "-- serult keymap elutasitva (CRC)\n";
  loadDefaultKeymap();

  // 6) Gombesemenyek: Alt+Win+R hosszu nyomasra (normal/G1)
  g_keyCount = g_consumerCount = g_keyReleaseCount = g_consumerReleaseCount = 0;
  longPressStart1();
  assert(g_keyCount == 1 && g_lastKey.code == HID_KEY_R
         && g_lastKey.modifier == (KEYBOARD_MODIFIER_LEFTGUI | KEYBOARD_MODIFIER_LEFTALT));
  longPressStop1();
  std::cout << "-- egyszeri hosszu nyomas ok (mod=0x" << std::hex
            << (int)g_lastKey.modifier << std::dec << ")\n";

  // 7) Ismetlodo hosszu nyomas (normal/G4 = le nyil, 30 ms).
  //    Gyarilag KULON LEUTESEK: minden ismetles utan felengedes is megy ki.
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_keyCount = 0; g_keyReleaseCount = 0;
  longPressStart4();
  longPress4();                       // elso ismetles azonnal
  assert(g_keyCount == 1 && g_lastKey.code == HID_KEY_ARROW_DOWN);
  assert(g_keyReleaseCount == 0);     // a felengedes az impulzus vegen jon
  settleTap();
  assert(g_keyReleaseCount == 1);     // most mar felengedve
  longPress4();                       // meg nem telt le az ismetlesi ido
  assert(g_keyCount == 1);
  g_millis += 40;
  longPress4();                       // most igen
  settleTap();
  assert(g_keyCount == 2 && g_keyReleaseCount == 2);
  assert(duringLongpress && !hasKeyPressed);
  longPressStop4();
  // a celpontok megmaradnak: a zaro felengedes a biztonsagi halo
  assert(!duringLongpress && hasKeyPressed);
  loop(); g_millis += 200; loop();
  assert(g_keyReleaseCount == 3);     // egy zaro biztonsagi felengedes
  std::cout << "-- ismetlodo hosszu nyomas kulon leutesekkel ok\n";

  // 7b) Ugyanez NYOMVA TARTVA (rep = csak ZW_REPEAT_ENABLED): a billentyu
  //     lenyomva marad, a felengedest a fociklus kuldi a gomb elengedesekor.
  expect(send("SET 0 3 2 1 0 81 1 30"), "OK", "normal/G4/hosszu -> nyomva tartva");
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_keyCount = 0; g_keyReleaseCount = 0;
  longPressStart4();
  longPress4();
  assert(g_keyCount == 1 && g_keyReleaseCount == 0);   // NEM enged fel
  g_millis += 40; longPress4();
  assert(g_keyCount == 2 && g_keyReleaseCount == 0);
  // Nyomva tartott modban a billentyu tenyleg lenyomva van: a tulajdonos ezt
  // jelzi is. A fociklus automatikus felengedeset a duringLongpress tiltja.
  assert(duringLongpress && hasKeyPressed);
  longPressStop4();
  assert(!duringLongpress && hasKeyPressed);
  loop(); g_millis += 200; loop();     // a fociklus engedi fel
  assert(g_keyReleaseCount == 1 && !hasKeyPressed);
  std::cout << "-- ismetlodo hosszu nyomas nyomva tartva ok\n";
  loadDefaultKeymap();

  // 8) Media consumer gomb (media/G2/rovid = play/pause)
  jelenlegiUzemmod = mediaVezerloUzemmod;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_consumerCount = 0;
  click2();
  assert(g_consumerCount == 1 && g_lastKey.consumer
         && g_lastKey.usage == HID_USAGE_CONSUMER_PLAY_PAUSE);
  std::cout << "-- consumer billentyu ok\n";

  // 9) Uzemmod valtas dupla kattintasra + mentes (a valos uton: loop()-on belul)
  jelenlegiUzemmod = normalUzemmod;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  g_fs.erase("/jelenlegiuzemmod.txt");
  g_pendingCb = doubleclick4;      // a kovetkezo tick()-en sul ki, mint igazibol
  loop();
  assert(jelenlegiUzemmod == versenyEdzesUzemmod);
  assert(g_fs["/jelenlegiuzemmod.txt"] == CONTENTVerseny);
  // MODE parancs szinten a loop()-on belul (handleSerial) fut le
  g_fs.erase("/jelenlegiuzemmod.txt");
  Serial.feed("MODE 2\n");
  loop();
  assert(jelenlegiUzemmod == mediaVezerloUzemmod);
  assert(g_fs["/jelenlegiuzemmod.txt"] == CONTENTMedia);
  std::cout << "-- uzemmod valtas (gomb + MODE parancs) es mentese ok\n";

  // 10) Nezetvaltas 1-9 korbe
  jelenlegiUzemmod = normalUzemmod; nezet = 0;
  for (int i = 1; i <= 10; i++) {
    hasKeyPressed = false; hasConsumerKeyPressed = false;
    doubleclick5();
    uint8_t want = (uint8_t)(HID_KEY_1 + ((i - 1) % 9));
    if (g_lastKey.code != want) { std::cout << "HIBA nezet " << i << "\n"; return 1; }
  }
  std::cout << "-- nezetvaltas (1-9 korbe) ok\n";

  // 11) BLE nelkul ne ragadjon be az allapot
  Bluefruit.isConnected = false;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  click1(); click1(); click1();
  assert(!hasKeyPressed && !hasConsumerKeyPressed);
  Bluefruit.isConnected = true;
  click1();
  assert(hasKeyPressed);
  std::cout << "-- BLE kapcsolat nelkuli allapotkezeles ok\n";

  // 12) Tul hosszu parancs
  expect(send(std::string(200, 'X')), "ERR TOOLONG", "tul hosszu parancs");
  expect(send("PING"), "OK ZWIFT_BUTTONS", "tullepes utan helyreall");
  std::cout << "-- parancs-puffer tullepes kezelve\n";

  // ==================== REGRESSZIOS TESZTEK (code review) ====================
  std::cout << "\n--- regresszios tesztek ---\n";

  // R1) A nezet-szamlalo ne csusszon el, ha a billentyu nem ment ki
  loadDefaultKeymap();
  jelenlegiUzemmod = normalUzemmod; nezet = 0;
  Bluefruit.isConnected = false;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  doubleclick5(); doubleclick5(); doubleclick5();   // BLE nincs -> nem megy ki semmi
  Bluefruit.isConnected = true;
  hasKeyPressed = false; hasConsumerKeyPressed = false;
  doubleclick5();
  if (g_lastKey.code != HID_KEY_1) {
    std::cout << "HIBA R1: nezet elcsuszott, kuldott kod=0x" << std::hex
              << (int)g_lastKey.code << std::dec << " (vart: HID_KEY_1)\n";
    return 1;
  }
  // ugyanez akkor is, ha egy korabbi billentyu meg nincs felengedve
  nezet = 0; hasKeyPressed = true;
  doubleclick5(); doubleclick5();
  hasKeyPressed = false;
  doubleclick5();
  assert(g_lastKey.code == HID_KEY_1);
  std::cout << "-- R1 nezet-szamlalo nem csuszik el\n";

  // R2) Ket gomb egyszerre nyomva: ne ragadjon be a billentyuzet-kod.
  //     Normal uzemmodban G4 hosszu = ismetlodo billentyu, G5 hosszu-t
  //     atallitjuk ismetlodo media billentyure.
  expect(send("SET 0 4 2 2 0 234 1 70"), "OK", "G5 hosszu = ismetlodo media (nyomva tartva)");
  jelenlegiUzemmod = normalUzemmod;
  hasKeyPressed = false; hasConsumerKeyPressed = false; keyPressMillis = 0;
  duringLongpress = false;
  g_keyCount = g_consumerCount = g_keyReleaseCount = g_consumerReleaseCount = 0;
  longPressStart4(); longPress4();          // G4 ismetel (billentyu)
  assert(g_keyCount == 1);
  longPressStart5(); longPress5();          // G5 atveszi (media)
  assert(g_consumerCount == 1);
  longPressStop4();                          // G4 elengedve (mar nem o ismetel)
  longPressStop5();                          // G5 elengedve
  loop(); g_millis += 200; loop();
  if (g_keyReleaseCount == 0) {
    std::cout << "HIBA R2: a billentyuzet-kod beragadt (nem volt keyRelease)\n";
    return 1;
  }
  assert(g_consumerReleaseCount >= 1);
  assert(!hasKeyPressed && !hasConsumerKeyPressed && !duringLongpress);
  std::cout << "-- R2 ket parhuzamos hosszu nyomas utan minden felengedve\n";
  loadDefaultKeymap();

  // R3) ACT_KEY eseten a 8 bitnel nagyobb kod hibat adjon (ne csonkoljon)
  expect(send("SET 0 0 0 1 0 336 0 60"), "ERR VALUE", "ACT_KEY kod > 0xFF");
  expect(send("SET 0 0 0 2 0 336 0 60"), "OK", "ACT_CONSUMER kod > 0xFF megengedett");
  expect(send("GET"), "MAP 0 0 0 2 0 336 0 60 0", "consumer kod valtozatlan");
  loadDefaultKeymap();
  std::cout << "-- R3 tul nagy billentyukod elutasitva, media kod atmegy\n";

