manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // R4) Sikertelen mentes ne semmisitse meg a korabbi kiosztast
  expect(send("SET 1 1 1 1 0 4 0 60"), "OK", "elso kiosztas");
  assert(saveKeymap());
  std::string savedGood = g_fs["/keymap.bin"];
  expect(send("SET 1 1 1 1 0 5 0 60"), "OK", "masodik kiosztas");
  g_fsWriteFail = true;                      // a flash iras most elromlik
  bool ok = saveKeymap();
  g_fsWriteFail = false;
  assert(!ok);
  if (g_fs.count("/keymap.bin") == 0) {
    std::cout << "HIBA R4: a sikertelen mentes torolte a regi kiosztast\n";
    return 1;
  }
  assert(g_fs["/keymap.bin"] == savedGood);
  assert(g_fs.count("/keymap.tmp") == 0);    // ne maradjon szemet
  memset(&keymap, 0, sizeof(keymap));
  assert(loadKeymap() && keymap.map[1][1][1].code == 4);
  std::cout << "-- R4 sikertelen mentes utan a regi kiosztas megmaradt\n";

  // R5) Sikeres mentes utan sincs ideiglenes fajl
  assert(saveKeymap());
  assert(g_fs.count("/keymap.tmp") == 0);
  std::cout << "-- R5 sikeres mentes nem hagy ideiglenes fajlt\n";

  // R6) Sikertelen uzemmod-mentes ne semmisitse meg a korabbi erteket
  //     (a hosszabb -> rovidebb irany a kritikus: "versenyEdzesUzemmod" -> "normalUzemmod")
  g_fs.erase("/jelenlegiuzemmod.txt");
  saveUzemmod(CONTENTVerseny);
  assert(g_fs["/jelenlegiuzemmod.txt"] == CONTENTVerseny);
  g_fsWriteFail = true;
  saveUzemmod(CONTENTNormal);              // a flash iras elromlik
  g_fsWriteFail = false;
  if (g_fs.count("/jelenlegiuzemmod.txt") == 0) {
    std::cout << "HIBA R6: a sikertelen mentes torolte a korabbi uzemmodot\n";
    return 1;
  }
  if (g_fs["/jelenlegiuzemmod.txt"] != CONTENTVerseny) {
    std::cout << "HIBA R6: serult uzemmod-fajl: '"
              << g_fs["/jelenlegiuzemmod.txt"] << "'\n";
    return 1;
  }
  assert(g_fs.count("/jelenlegiuzemmod.tmp") == 0);
  std::cout << "-- R6 sikertelen uzemmod-mentes utan a regi ertek megmaradt\n";

  // R7) Hosszabb -> rovidebb ertek irasakor ne maradjon szemet a vegen
  saveUzemmod(CONTENTNormal);
  if (g_fs["/jelenlegiuzemmod.txt"] != CONTENTNormal) {
    std::cout << "HIBA R7: '" << g_fs["/jelenlegiuzemmod.txt"]
              << "' (vart: " << CONTENTNormal << ")\n";
    return 1;
  }
  assert(g_fs.count("/jelenlegiuzemmod.tmp") == 0);
  // es a boot-logika is helyesen olvassa vissza
  assert(readStoredMode() == normalUzemmod);
  std::cout << "-- R7 rovidebb ertek irasakor nem marad szemet a fajl vegen\n";

  // R8) A media billentyuk a VALODI kapcsolat-azonositora menjenek, ne a
  //     hardkodolt 0-ra. Szandekosan olyan handle-t hasznalunk, ami nem 0.
  disconnectPeer(0);
  connectPeer(2, 0xC0);
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  g_lastConnHdl = 99;
  click2();                                  // media/G2/rovid = play/pause
  assert(g_consumerCount == 1);
  if (g_lastConnHdl != 2) {
    std::cout << "HIBA R8: a media billentyu conn_hdl=" << g_lastConnHdl
              << " -re ment, pedig az elo kapcsolat a 2-es\n";
    return 1;
  }
  // ugyanez az ismetlodo hosszu nyomasnal (media/G4/hosszu = hangero -)
  resetKeyState();
  g_lastConnHdl = 99;
  longPressStart4(); longPress4();
  assert(g_lastKey.consumer);
  if (g_lastConnHdl != 2) {
    std::cout << "HIBA R8: az ismetlodo media kuldes conn_hdl=" << g_lastConnHdl << "\n";
    return 1;
  }
  longPressStop4();
  std::cout << "-- R8 media billentyuk a valodi kapcsolat-azonositora mennek\n";
  disconnectPeer(2);
  connectPeer(0, 0xA0);                      // alaphelyzet a kovetkezo tesztekhez

  // ==================== TOBB EGYIDEJU KAPCSOLAT ====================
  std::cout << "\n--- ket eszkoz egyszerre ---\n";

  // R9) Gyari cel-beallitasok
  loadDefaultKeymap();
  assert(keymap.modeTarget[0] == ZW_TARGET_PC);
  assert(keymap.modeTarget[1] == ZW_TARGET_PC);
  assert(keymap.modeTarget[2] == ZW_TARGET_ALL);
  expect(send("GET"), "TARGET 0 1", "Normal -> csak PC");
  expect(send("GET"), "TARGET 1 1", "Verseny -> csak PC");
  expect(send("GET"), "TARGET 2 3", "Media -> mindketto");
  std::cout << "-- R9 gyari celpontok: Normal/Verseny=PC, Media=mindketto\n";

  // R10) Masodik eszkoz csatlakozasa + hirdetes ujrainditasa
  int advBefore = Bluefruit.Advertising.startCount;
  connectPeer(1, 0xB0);
  assert(connHandles[0] == 0 && connHandles[1] == 1);
  // ket kapcsolat van, tobb hely nincs -> ne hirdessen tovabb
  assert(Bluefruit.Advertising.startCount == advBefore);
  std::cout << "-- R10 masodik eszkoz csatlakozott, a hirdetes leallt\n";

  // R11) Hozzarendeles nelkul minden kapcsolatra megy (kicsomagolas utani allapot)
  expect(send("CLEARSLOT 0"), "OK", "0-s fiok torlese");
  expect(send("CLEARSLOT 1"), "OK", "1-es fiok torlese");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  std::cout << "-- R11 hozzarendeles nelkul mindket eszkoz megkapja\n";

  // R12) Fiokok hozzarendelese: conn 0 = PC, conn 1 = telefon
  expect(send("ASSIGN 0 0"), "OK", "PC = conn 0");
  expect(send("ASSIGN 1 1"), "OK", "telefon = conn 1");
  expect(send("PEERS"), "CONN 0 A5:A4:A3:A2:A1:A0 0", "conn 0 a 0-s fiokban");
  expect(send("PEERS"), "CONN 1 B5:B4:B3:B2:B1:B0 1", "conn 1 az 1-es fiokban");
  expect(send("PEERS"), "SLOT 0 1 A5:A4:A3:A2:A1:A0", "0-s fiok cime");
  std::cout << "-- R12 fiok-hozzarendeles BLE cim alapjan\n";

  // R13) Normal uzemmod: CSAK a PC kapja meg
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  click1();
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 0)) {
    std::cout << "HIBA R13: Normal uzemmodban PC=" << g_sentTo[0]
              << " telefon=" << g_sentTo[1] << " (vart: 1 / 0)\n";
    return 1;
  }
  // a felengedes is csak a PC-re megy
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(g_keyReleaseCount == 1);
  std::cout << "-- R13 Normal uzemmod: csak a PC kap gombnyomast es felengedest\n";

  // R14) Media uzemmod: MINDKET eszkoz megkapja
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  click2();                       // media/G2/rovid = play/pause
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 1)) {
    std::cout << "HIBA R14: Media uzemmodban PC=" << g_sentTo[0]
              << " telefon=" << g_sentTo[1] << " (vart: 1 / 1)\n";
    return 1;
  }
  assert(pressedTargetCount == 2);
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(g_consumerReleaseCount == 2);   // mindket kapcsolatra megy a felengedes
  std::cout << "-- R14 Media uzemmod: mindket eszkoz kap gombnyomast es felengedest\n";

