manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // R26) Gyari felulbiralas: a gepfuggo parancsok csak a PC-re mennek
  expect(send("GET"), "MAP 2 0 2 1 12 21 0 0 1", "Media/G1/hosszu gyarilag csak PC");
  jelenlegiUzemmod = mediaVezerloUzemmod;       // az uzemmod celpontja: mindketto
  // a harom gepfuggo hosszu nyomas gyarilag CSAK a PC-re megy
  for (uint8_t b = 0; b < 3; b++) {
    assert(keymap.map[2][b][EV_LONG].target == ZW_TARGET_PC);
  }
  resetKeyState(); longPressStart1();
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 0)) {
    std::cout << "HIBA R26: G1 hosszu PC=" << g_sentTo[0] << " telefon=" << g_sentTo[1] << "\n";
    return 1;
  }
  resetKeyState(); longPressStart3();
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 0)) {
    std::cout << "HIBA R26: G3 hosszu PC=" << g_sentTo[0] << " telefon=" << g_sentTo[1] << "\n";
    return 1;
  }
  // a media gombok viszont tovabbra is mindkettore
  resetKeyState(); click1();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  resetKeyState(); longPressStart4(); longPress4();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  longPressStop4();
  std::cout << "-- R26 gyarilag a 3 gepfuggo hosszu nyomas csak a PC-re megy\n";

  // R27) Media/G1 hosszu -> csak a PC, kozben a tobbi cella valtozatlan
  expect(send("SET 2 0 2 1 12 21 0 60 1"), "OK", "Media/G1/hosszu -> csak PC");
  resetKeyState();
  longPressStart1();
  if (!(g_sentTo[0] == 1 && g_sentTo[1] == 0)) {
    std::cout << "HIBA R27: PC=" << g_sentTo[0] << " telefon=" << g_sentTo[1]
              << " (vart: 1 / 0)\n";
    return 1;
  }
  // ugyanennek a gombnak a ROVID nyomasa tovabbra is mindkettore megy
  resetKeyState();
  click1();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  std::cout << "-- R27 csak a hosszu nyomas celja valtozott, a rovide nem\n";

  // R28) Media/G2 hosszu -> csak a telefon
  expect(send("SET 2 1 2 1 4 43 0 60 2"), "OK", "Media/G2/hosszu -> csak telefon");
  resetKeyState();
  longPressStart2();
  assert(g_sentTo[0] == 0 && g_sentTo[1] == 1);
  // a G5 hosszu nyomasa (nincs felulbiralva) tovabbra is mindkettore megy
  resetKeyState();
  longPressStart5(); longPress5();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1);
  longPressStop5();
  std::cout << "-- R28 gombonkent kulon allithato, a tobbit nem erinti\n";

  // R29) A felulbiralas az ismetlodo hosszu nyomasra is vonatkozik
  expect(send("SET 2 3 2 2 0 234 1 70 1"), "OK", "Media/G4/hosszu ismetlo -> csak PC");
  resetKeyState();
  longPressStart4(); longPress4();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 0);
  g_millis += 100; longPress4();
  assert(g_sentTo[0] == 2 && g_sentTo[1] == 0);
  longPressStop4();
  std::cout << "-- R29 az ismetles is a felulbiralt celpontra megy\n";

  // R30) Ervenytelen maszk elutasitva, a 9. mezo elhagyhato marad
  expect(send("SET 2 0 2 1 12 21 0 60 4"), "ERR VALUE", "ismeretlen cel-bit");
  expect(send("SET 2 0 2 1 12 21 0 60"), "OK", "a 9. mezo elhagyhato");
  expect(send("GET"), "MAP 2 0 2 1 12 21 0 60 0", "elhagyva 0 lesz (oroklodik)");
  std::cout << "-- R30 ervenytelen maszk elutasitva, a mezo elhagyhato\n";

  // R31) A felulbiralas tulel egy flash korbeerest
  expect(send("SET 2 0 2 1 12 21 0 60 1"), "OK", "felulbiralas visszaallitva");
  assert(saveKeymap());
  memset(&keymap, 0, sizeof(keymap));
  assert(loadKeymap());
  assert(keymap.map[2][0][2].target == ZW_TARGET_PC);
  assert(keymap.map[2][2][2].target == ZW_TARGET_PC);
  std::cout << "-- R31 a felulbiralas tulelte a mentest\n";

  // ==================== HARMADIK KOROS REVIEW ====================
  std::cout << "\n--- harmadik koros regresszio ---\n";
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  send("ASSIGN 0 0"); send("ASSIGN 1 1");

  // R32) Ismetles kozben inditott MASIK muvelet ne ragadjon be a sajat celpontjan
  expect(send("SETTARGET 2 2"), "OK", "Media uzemmod -> csak telefon");
  expect(send("SET 2 0 2 1 12 21 0 60 1"), "OK", "Media/G1/hosszu -> csak PC");
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  longPressStart4(); longPress4();           // G4 ismetel a telefonra
  assert(g_sentTo[1] == 1 && duringLongpress);
  longPressStart1();                          // kozben G1 hosszu nyomas (PC)
  if (g_sentTo[0] != 0) {
    std::cout << "HIBA R32: ismetles kozben masik muvelet indult (PC=" << g_sentTo[0]
              << "), aminek a felengedese elmaradna\n";
    return 1;
  }
  longPressStop1();
  longPressStop4();
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(!hasKeyPressed && !hasConsumerKeyPressed && pressedTargetCount == 0);
  std::cout << "-- R32 ismetles alatt nem indul masik kuldes (nincs beragadas)\n";
  send("SETTARGET 2 3"); loadDefaultKeymap();

  // R33) Ismetles vege utan csak a tenylegesen kuldott fajta engedodjon fel
  jelenlegiUzemmod = mediaVezerloUzemmod;     // G4 hosszu = media, ismetlo
  resetKeyState();
  longPressStart4(); longPress4();
  longPressStop4();
  g_millis += 200; loop(); g_millis += 200; loop();
  if (g_keyReleaseCount != 0) {
    std::cout << "HIBA R33: media ismetles utan folosleges billentyu-felengedes\n";
    return 1;
  }
  assert(g_consumerReleaseCount >= 1);
  // billentyus ismetlesnel forditva
  jelenlegiUzemmod = normalUzemmod;           // G4 hosszu = le nyil, ismetlo
  resetKeyState();
  longPressStart4(); longPress4();
  longPressStop4();
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(g_keyReleaseCount >= 1 && g_consumerReleaseCount == 0);
  std::cout << "-- R33 csak a ténylegesen kuldott fajta engedodik fel\n";

  // R34) Ket gomb: az atvett ismetles azonnal felengedodik a regi celponton
  // Mindketto NYOMVA TARTVA modban, kulonben nincs mit felengedni atvetelkor.
  expect(send("SET 0 3 2 1 0 81 1 30"), "OK", "Normal/G4/hosszu = billentyu, nyomva tartva");
  expect(send("SET 0 4 2 2 0 234 1 70"), "OK", "Normal/G5/hosszu = media, nyomva tartva");
  jelenlegiUzemmod = normalUzemmod;
  resetKeyState();
  longPressStart4(); longPress4();            // billentyus ismetles (nyomva tartva)
  assert(g_keyCount == 1 && g_keyReleaseCount == 0);
  longPressStart5();                           // G5 atveszi
  if (g_keyReleaseCount == 0) {
    std::cout << "HIBA R34: az atvett ismetles billentyuje nem lett felengedve\n";
    return 1;
  }
  longPress5();
  longPressStop5();
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(!hasKeyPressed && !hasConsumerKeyPressed);
  std::cout << "-- R34 atvetelkor a regi ismetles azonnal felengedodik\n";
  loadDefaultKeymap();

  // R35) A bontast a fociklus veszi eszre (a callback nem turkalja az allapotot)
  jelenlegiUzemmod = mediaVezerloUzemmod;
  resetKeyState();
  click2();                                    // mindket eszkozre megy
  assert(pressedTargetCount == 2);
  g_conns[0].up = false;                       // a PC eltunik, callback nelkul is
  disconnect_callback(0, 0x13);
  assert(pressedTargetCount == 2);             // a callback nem nyul hozza
  loop();
  assert(pressedTargetCount == 1 && pressedTargets[0] == 1);
  g_millis += 200; loop(); g_millis += 200; loop();
  assert(g_consumerReleaseCount >= 1 && !hasConsumerKeyPressed);
  std::cout << "-- R35 a bontast a fociklus takaritja, a felengedes kimegy\n";
  connectPeer(0, 0xA0);

  // R36) Regi, hosszabb ideiglenes fajl ne fuzodjon hozza az uj tartalomhoz
  g_fs["/jelenlegiuzemmod.tmp"] = "versenyEdzesUzemmod";   // ottmaradt szemet
  saveUzemmod(CONTENTNormal);
  if (g_fs["/jelenlegiuzemmod.txt"] != CONTENTNormal) {
    std::cout << "HIBA R36: '" << g_fs["/jelenlegiuzemmod.txt"] << "'\n";
    return 1;
  }
  assert(readStoredMode() == normalUzemmod);
  std::cout << "-- R36 ottmaradt ideiglenes fajl nem rontja el a mentest\n";

  // R37) Az uzemmod beolvasasa Arduino String nelkul, ervenytelen tartalomra is
  g_fs["/jelenlegiuzemmod.txt"] = "valami egeszen mas";
  assert(readStoredMode() == normalUzemmod);
  g_fs["/jelenlegiuzemmod.txt"] = CONTENTMedia;
  assert(readStoredMode() == mediaVezerloUzemmod);
  g_fs.erase("/jelenlegiuzemmod.txt");
  assert(readStoredMode() == normalUzemmod);
  assert(g_fs.count("/jelenlegiuzemmod.txt") == 1);   // letre is hozta
  std::cout << "-- R37 uzemmod-beolvasas fix pufferrel, hibas tartalomra is\n";

  // ==================== ISMETLES: KULON LEUTESEK ====================
  std::cout << "\n--- ismetles: felengedes az ismetlesek kozott ---\n";
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0);

