manszabi/zwift_buttons_Seeed-XIAO-nRF52840/tools/tests/firmware_test.cpp
  // R62) Ismetles kozben ne induljon idozitett kuldes (masik celponton beragadna)
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  send("ASSIGN 0 0"); send("ASSIGN 1 1");
  jelenlegiUzemmod = mediaVezerloUzemmod;
  // G4 hosszu: media, NYOMVA TARTVA (rep=1) -> nincs kozbenso felengedes
  expect(send("SET 2 3 2 2 0 234 1 200"), "OK", "G4 hosszu = nyomva tartva");
  // G1 rovid: 1000 ms-os idozitett kuldes, CSAK a PC-re
  expect(send("SET 2 0 0 1 0 80 0 60 1 1000"), "OK", "G1 rovid = 1000 ms, csak PC");
  resetKeyState();
  for (int i = 0; i < 8; i++) g_releasedTo[i] = 0;
  longPressStart4(); longPress4();
  assert(g_sentTo[0] == 1 && g_sentTo[1] == 1 && duringLongpress);
  click1();                     // ismetles kozben erkezo rovid nyomas
  if (burstActive) {
    std::cout << "HIBA R62: ismetles kozben elindult egy idozitett kuldes, "
              << "a masik celponton beragadna a billentyu\n";
    return 1;
  }
  longPressStop4();
  for (int i = 0; i < 40; i++) { g_millis += 40; loop(); }
  if (g_releasedTo[1] == 0) {
    std::cout << "HIBA R62: a telefon nem kapott felengedest\n";
    return 1;
  }
  assert(!hasKeyPressed && !hasConsumerKeyPressed && pressedTargetCount == 0);
  // az ismetles vege utan viszont mar indulhat
  resetKeyState();
  click1();
  assert(burstActive);
  for (int i = 0; i < 50; i++) { g_millis += 40; loop(); }
  assert(!burstActive);
  std::cout << "-- R62 ismetles kozben nem indul idozitett kuldes\n";

  // R63) A review altal jelzett firmware-hibak
  // a) kapcsolat-veszte utan ne ragadjon az ismetles-lenyomat
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(1);
  jelenlegiUzemmod = normalUzemmod;      // G4 hosszu = billentyu
  resetKeyState();
  longPressStart4(); longPress4();
  assert(g_keyCount == 1);
  disconnectPeer(0);                      // megszakad a kapcsolat
  loop();                                 // pruneLostTargets
  longPressStop4();
  connectPeer(0, 0xA0);
  jelenlegiUzemmod = mediaVezerloUzemmod; // G5 hosszu = MEDIA tipus
  resetKeyState();
  longPressStart5();
  for (int i = 0; i < 5; i++) { g_millis += 100; longPress5(); }
  if (g_consumerCount == 0) {
    std::cout << "HIBA R63a: a korabbi ismetles lenyomata miatt az uj ismetles"
              << " azonnal megszakadt\n";
    return 1;
  }
  longPressStop5();
  for (int i = 0; i < 5; i++) { g_millis += 50; loop(); }

  // b) ha a celpont nincs csatlakozva, az idozitett kuldes ne blokkoljon
  loadDefaultKeymap();
  send("ASSIGN 0 0");                     // csak a PC van hozzarendelve
  jelenlegiUzemmod = mediaVezerloUzemmod;
  expect(send("SET 2 4 0 1 0 80 0 60 2 5000"), "OK", "G5 rovid: 5 s, csak telefonra");
  resetKeyState();
  click5();
  if (burstActive) {
    std::cout << "HIBA R63b: elindult a kuldes, pedig egyetlen celpont sem volt\n";
    return 1;
  }
  {
    int before = g_keyCount + g_consumerCount;
    for (int i = 0; i < 5; i++) { g_millis += 50; loop(); click1(); }
    if (g_keyCount + g_consumerCount == before) {
      std::cout << "HIBA R63b: a tobbi gomb is nemava valt\n";
      return 1;
    }
  }

  // c) a kuldesi hossz also hatara
  loadDefaultKeymap();
  expect(send("SET 0 0 0 1 0 4 0 60 0 20"), "ERR VALUE", "20 ms tul rovid");
  expect(send("SET 0 0 0 1 0 4 0 60 0 50"), "OK", "50 ms elfogadva");
  expect(send("SET 0 0 0 1 0 4 0 60 0 0"), "OK", "0 = rovid impulzus");
  std::cout << "-- R63 kapcsolat-veszte, ures celpont es hossz-hatar rendben\n";

  // R64) Ket eszkoz: ha az EGYIK kiesik, tudjon-e visszacsatlakozni
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  assert(!Bluefruit.Advertising.isRunning());   // ket kapcsolat: nincs mit hirdetni
  disconnectPeer(1);                            // a telefon kiesik
  if (!Bluefruit.Advertising.isRunning()) {
    std::cout << "HIBA R64: egy kapcsolat kiesese utan nem hirdet az eszkoz, "
              << "a kiesett eszkoz nem tud visszacsatlakozni\n";
    return 1;
  }
  connectPeer(1, 0xB0);                         // vissza is tud jonni
  assert(Bluefruit.connected() == 2);
  std::cout << "-- R64 egy kapcsolat kiesese utan ujra hirdet az eszkoz\n";

  // R65) Ismetles kozben az EGYIK kapcsolat kiesik: a masik mukodjon tovabb
  loadDefaultKeymap();
  send("CLEARSLOT 0"); send("CLEARSLOT 1");
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xA0); connectPeer(1, 0xB0);
  send("ASSIGN 0 0"); send("ASSIGN 1 1");
  jelenlegiUzemmod = mediaVezerloUzemmod;    // G4 hosszu: mindket eszkozre
  resetKeyState();
  longPressStart4(); longPress4();
  assert(g_sentTo[0] >= 1 && g_sentTo[1] >= 1);
  disconnectPeer(1);                          // a telefon kiesik
  loop();
  assert(pressedTargetCount == 1);            // a PC megmarad celpontnak
  {
    int pcBefore = g_sentTo[0];
    for (int i = 0; i < 6; i++) { g_millis += 100; longPress4(); }
    if (g_sentTo[0] == pcBefore) {
      std::cout << "HIBA R65: az egyik kapcsolat kiesese utan a masik sem kap\n";
      return 1;
    }
  }
  longPressStop4();
  for (int i = 0; i < 10; i++) { g_millis += 50; loop(); }
  assert(!hasKeyPressed && !hasConsumerKeyPressed && pressedTargetCount == 0);
  std::cout << "-- R65 egy kapcsolat kiesese nem allitja le a masikat\n";

  // R66) Visszacsatlakozas MAS kapcsolat-azonositoval: a fiok a BLE cim alapjan
  disconnectPeer(0); disconnectPeer(1);
  connectPeer(0, 0xB0);                       // a TELEFON jon vissza, de 0-s azonositoval
  if (slotOfConnTest(0) != 1) {
    std::cout << "HIBA R66: a telefon nem a sajat fiokjaba kerult (kapott: "
              << (int)slotOfConnTest(0) << ")\n";
    return 1;
  }
  jelenlegiUzemmod = normalUzemmod;           // Normal: csak a PC-re megy
  resetKeyState();
  click1();
  if (g_sentTo[0] != 0) {
    std::cout << "HIBA R66: a PC-nek szolo parancs a telefonra ment\n";
    return 1;
  }
  std::cout << "-- R66 a fiok a BLE cimet koveti, nem a kapcsolat-azonositot\n";

  std::cout << "\nMINDEN TESZT SIKERES\n";
  return 0;
}
